#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warnings:

- Deprecated Resource
  on modules/vertex-ai-workbench/main.tf line 49

To see the full warning notes, run Terraform without -compact-warnings.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.google_client_config.provider: Reading...
data.google_client_config.provider: Read complete after 0s [id=projects/"tbd-2024l-303946"/regions/"europe-west1"/zones/<null>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_container_cluster.composer-gke-cluster will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_cluster" "composer-gke-cluster" {
      + addons_config                     = (known after apply)
      + allow_net_admin                   = (known after apply)
      + authenticator_groups_config       = (known after apply)
      + binary_authorization              = (known after apply)
      + cluster_autoscaling               = (known after apply)
      + cluster_ipv4_cidr                 = (known after apply)
      + confidential_nodes                = (known after apply)
      + cost_management_config            = (known after apply)
      + database_encryption               = (known after apply)
      + datapath_provider                 = (known after apply)
      + default_max_pods_per_node         = (known after apply)
      + default_snat_status               = (known after apply)
      + deletion_protection               = (known after apply)
      + description                       = (known after apply)
      + dns_config                        = (known after apply)
      + enable_autopilot                  = (known after apply)
      + enable_intranode_visibility       = (known after apply)
      + enable_k8s_beta_apis              = (known after apply)
      + enable_kubernetes_alpha           = (known after apply)
      + enable_l4_ilb_subsetting          = (known after apply)
      + enable_legacy_abac                = (known after apply)
      + enable_shielded_nodes             = (known after apply)
      + enable_tpu                        = (known after apply)
      + endpoint                          = (known after apply)
      + fleet                             = (known after apply)
      + gateway_api_config                = (known after apply)
      + id                                = (known after apply)
      + identity_service_config           = (known after apply)
      + initial_node_count                = (known after apply)
      + ip_allocation_policy              = (known after apply)
      + label_fingerprint                 = (known after apply)
      + location                          = "europe-west1"
      + logging_config                    = (known after apply)
      + logging_service                   = (known after apply)
      + maintenance_policy                = (known after apply)
      + master_auth                       = (known after apply)
      + master_authorized_networks_config = (known after apply)
      + master_version                    = (known after apply)
      + mesh_certificates                 = (known after apply)
      + min_master_version                = (known after apply)
      + monitoring_config                 = (known after apply)
      + monitoring_service                = (known after apply)
      + name                              = (known after apply)
      + network                           = (known after apply)
      + network_policy                    = (known after apply)
      + networking_mode                   = (known after apply)
      + node_config                       = (known after apply)
      + node_locations                    = (known after apply)
      + node_pool                         = (known after apply)
      + node_pool_auto_config             = (known after apply)
      + node_pool_defaults                = (known after apply)
      + node_version                      = (known after apply)
      + notification_config               = (known after apply)
      + operation                         = (known after apply)
      + private_cluster_config            = (known after apply)
      + private_ipv6_google_access        = (known after apply)
      + release_channel                   = (known after apply)
      + remove_default_node_pool          = (known after apply)
      + resource_labels                   = (known after apply)
      + resource_usage_export_config      = (known after apply)
      + security_posture_config           = (known after apply)
      + self_link                         = (known after apply)
      + service_external_ips_config       = (known after apply)
      + services_ipv4_cidr                = (known after apply)
      + subnetwork                        = (known after apply)
      + tpu_ipv4_cidr_block               = (known after apply)
      + vertical_pod_autoscaling          = (known after apply)
      + workload_identity_config          = (known after apply)
    }

  # google_compute_firewall.allow-all-internal will be created
  + resource "google_compute_firewall" "allow-all-internal" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-all-internal"
      + network            = "main-vpc"
      + priority           = 1000
      + project            = "tbd-2024l-303946"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.0.0.0/8",
        ]

      + allow {
          + ports    = []
          + protocol = "all"
        }
    }

  # kubernetes_service.dbt-task-service will be created
  + resource "kubernetes_service" "dbt-task-service" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "dbt-app"
            }
          + name             = "dbt-task-service"
          + namespace        = "composer-user-workloads"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "app" = "dbt-app"
            }
          + session_affinity                  = "None"
          + type                              = "NodePort"

          + port {
              + name        = "spark-driver"
              + node_port   = 30000
              + port        = 30000
              + protocol    = "TCP"
              + target_port = "30000"
            }
          + port {
              + name        = "spark-block-mgr"
              + node_port   = 30001
              + port        = 30001
              + protocol    = "TCP"
              + target_port = "30001"
            }
        }
    }

  # module.composer.google_compute_subnetwork.composer-subnet will be created
  + resource "google_compute_subnetwork" "composer-subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.11.0.0/16"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "composer-subnet-01"
      + network                    = "main-vpc"
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS"
      + project                    = "tbd-2024l-303946"
      + purpose                    = (known after apply)
      + region                     = "europe-west1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_10_MIN"
          + filter_expr          = "true"
          + flow_sampling        = 0.5
          + metadata             = "INCLUDE_ALL_METADATA"
        }
    }

  # module.composer.google_project_iam_member.composer-member will be created
  + resource "google_project_iam_member" "composer-member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "tbd-2024l-303946"
      + role    = "roles/composer.worker"
    }

  # module.composer.google_project_iam_member.dataproc-editor-iam will be created
  + resource "google_project_iam_member" "dataproc-editor-iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "tbd-2024l-303946"
      + role    = "roles/dataproc.editor"
    }

  # module.composer.google_project_iam_member.dataproc-sa-user-iam will be created
  + resource "google_project_iam_member" "dataproc-sa-user-iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "tbd-2024l-303946"
      + role    = "roles/iam.serviceAccountUser"
    }

  # module.composer.google_project_service.api["composer.googleapis.com"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "tbd-2024l-303946"
      + service            = "composer.googleapis.com"
    }

  # module.composer.google_service_account.tbd-composer-sa will be created
  + resource "google_service_account" "tbd-composer-sa" {
      + account_id = "tbd-2024l-303946-data"
      + disabled   = false
      + email      = (known after apply)
      + id         = (known after apply)
      + member     = (known after apply)
      + name       = (known after apply)
      + project    = "tbd-2024l-303946"
      + unique_id  = (known after apply)
    }

  # module.data-pipelines.google_storage_bucket.tbd-code-bucket will be created
  + resource "google_storage_bucket" "tbd-code-bucket" {
      + effective_labels            = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "EUROPE-WEST1"
      + name                        = "tbd-2024l-303946-code"
      + project                     = "tbd-2024l-303946"
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = false
      + url                         = (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # module.data-pipelines.google_storage_bucket.tbd-data-bucket will be created
  + resource "google_storage_bucket" "tbd-data-bucket" {
      + effective_labels            = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "EUROPE-WEST1"
      + name                        = "tbd-2024l-303946-data"
      + project                     = "tbd-2024l-303946"
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = false
      + url                         = (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # module.data-pipelines.google_storage_bucket_iam_member.tbd-code-bucket-iam-viewer will be created
  + resource "google_storage_bucket_iam_member" "tbd-code-bucket-iam-viewer" {
      + bucket = "tbd-2024l-303946-code"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectViewer"
    }

  # module.data-pipelines.google_storage_bucket_iam_member.tbd-data-bucket-iam-editor will be created
  + resource "google_storage_bucket_iam_member" "tbd-data-bucket-iam-editor" {
      + bucket = "tbd-2024l-303946-data"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectUser"
    }

  # module.data-pipelines.google_storage_bucket_object.dag-code["data-dag.py"] will be created
  + resource "google_storage_bucket_object" "dag-code" {
      + bucket         = (known after apply)
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = (known after apply)
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "modules/data-pipeline/resources/data-dag.py"
      + storage_class  = (known after apply)
    }

  # module.data-pipelines.google_storage_bucket_object.dbt-dag-code["dbt-dag.py"] will be created
  + resource "google_storage_bucket_object" "dbt-dag-code" {
      + bucket         = (known after apply)
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = (known after apply)
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "modules/data-pipeline/resources/dbt-dag.py"
      + storage_class  = (known after apply)
    }

  # module.data-pipelines.google_storage_bucket_object.job-code["spark-job.py"] will be created
  + resource "google_storage_bucket_object" "job-code" {
      + bucket         = "tbd-2024l-303946-code"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "spark-job.py"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "modules/data-pipeline/resources/spark-job.py"
      + storage_class  = (known after apply)
    }

  # module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster will be created
  + resource "google_dataproc_cluster" "tbd-dataproc-cluster" {
      + effective_labels              = (known after apply)
      + graceful_decommission_timeout = "0s"
      + id                            = (known after apply)
      + name                          = "tbd-cluster"
      + project                       = "tbd-2024l-303946"
      + region                        = "europe-west1"
      + terraform_labels              = (known after apply)

      + cluster_config {
          + bucket      = (known after apply)
          + temp_bucket = (known after apply)

          + gce_cluster_config {
              + internal_ip_only       = true
              + metadata               = {
                  + "PIP_PACKAGES" = "pandas<2 mlflow==2.3.1 google-cloud-storage==2.9.0"
                  + "vmDnsSetting" = "GlobalDefault"
                }
              + network                = (known after apply)
              + service_account_scopes = (known after apply)
              + subnetwork             = (known after apply)
              + zone                   = (known after apply)
            }

          + initialization_action {
              + script      = "gs://goog-dataproc-initialization-actions-europe-west1/python/pip-install.sh"
              + timeout_sec = 600
            }

          + master_config {
              + image_uri        = (known after apply)
              + instance_names   = (known after apply)
              + machine_type     = "e2-standard-2"
              + min_cpu_platform = (known after apply)
              + num_instances    = 1

              + disk_config {
                  + boot_disk_size_gb = 100
                  + boot_disk_type    = "pd-standard"
                  + num_local_ssds    = (known after apply)
                }
            }

          + software_config {
              + image_version = "2.1.27-ubuntu20"
              + properties    = (known after apply)
            }

          + worker_config {
              + image_uri         = (known after apply)
              + instance_names    = (known after apply)
              + machine_type      = "e2-standard-2"
              + min_cpu_platform  = (known after apply)
              + min_num_instances = (known after apply)
              + num_instances     = 2

              + disk_config {
                  + boot_disk_size_gb = 100
                  + boot_disk_type    = "pd-standard"
                  + num_local_ssds    = (known after apply)
                }
            }
        }
    }

  # module.dataproc.google_project_service.dataproc will be created
  + resource "google_project_service" "dataproc" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "tbd-2024l-303946"
      + service            = "dataproc.googleapis.com"
    }

  # module.dbt_docker_image.docker_image.dbt will be created
  + resource "docker_image" "dbt" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2024l-303946/dbt:1.7.3"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "16d9a47a192d8b357f5d8b2ba5b77c3a61503388"
        }

      + build {
          + build_args   = {
              + "DBT_SPARK_VERSION" = "1.7.1"
              + "DBT_VERSION"       = "1.7.3"
              + "PROJECT_NAME"      = "tbd-2024l-303946"
              + "SPARK_VERSION"     = "3.3.2"
            }
          + cache_from   = []
          + context      = "modules/dbt_docker_image/resources"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "eu.gcr.io/tbd-2024l-303946/dbt:latest",
            ]
        }
    }

  # module.dbt_docker_image.docker_registry_image.dbt will be created
  + resource "docker_registry_image" "dbt" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = "eu.gcr.io/tbd-2024l-303946/dbt:1.7.3"
      + sha256_digest        = (known after apply)
      + triggers             = {
          + "dir_sha1" = "16d9a47a192d8b357f5d8b2ba5b77c3a61503388"
        }
    }

  # module.gcr.google_artifact_registry_repository.registry will be created
  + resource "google_artifact_registry_repository" "registry" {
      + create_time      = (known after apply)
      + description      = "TBD Docker repository"
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "europe"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "tbd-2024l-303946"
      + repository_id    = "eu.gcr.io"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)

      + docker_config {
          + immutable_tags = true
        }
    }

  # module.gcr.google_project_service.api["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "tbd-2024l-303946"
      + service            = "artifactregistry.googleapis.com"
    }

  # module.jupyter_docker_image.docker_image.jupyter will be created
  + resource "docker_image" "jupyter" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2024l-303946/jupyter:3.6.3"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "0ae070775d3102ba9dae4391e78e62e46185e752"
        }

      + build {
          + build_args   = {
              + "DBT_SPARK_VERSION"     = "1.7.1"
              + "DBT_VERSION"           = "1.7.3"
              + "GCS_CONNECTOR_VERSION" = "2.2.17"
              + "JUPYTERLAB_VERSION"    = "3.6.3"
              + "PROJECT_NAME"          = "tbd-2024l-303946"
              + "SPARK_VERSION"         = "3.3.2"
            }
          + cache_from   = []
          + context      = "modules/jupyter_docker_image/resources"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "eu.gcr.io/tbd-2024l-303946/jupyter:latest",
            ]
        }
    }

  # module.jupyter_docker_image.docker_registry_image.jupyterlab will be created
  + resource "docker_registry_image" "jupyterlab" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = "eu.gcr.io/tbd-2024l-303946/jupyter:3.6.3"
      + sha256_digest        = (known after apply)
      + triggers             = {
          + "dir_sha1" = "0ae070775d3102ba9dae4391e78e62e46185e752"
        }
    }

  # module.vertex_ai_workbench.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "tbd-2024l-303946"
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook will be created
  + resource "google_notebooks_instance" "tbd_notebook" {
      + create_time            = (known after apply)
      + desired_state          = "ACTIVE"
      + disk_encryption        = (known after apply)
      + effective_labels       = (known after apply)
      + id                     = (known after apply)
      + instance_owners        = [
          + "mikolajpater123@gmail.com",
        ]
      + location               = "europe-west1-b"
      + machine_type           = "e2-standard-2"
      + metadata               = {
          + "vmDnsSetting" = "GlobalDefault"
        }
      + name                   = "tbd-2024l-303946-notebook"
      + network                = (known after apply)
      + no_proxy_access        = true
      + no_public_ip           = true
      + post_startup_script    = "gs://tbd-2024l-303946-conf/scripts/notebook_post_startup_script.sh"
      + project                = "tbd-2024l-303946"
      + proxy_uri              = (known after apply)
      + service_account        = (known after apply)
      + service_account_scopes = (known after apply)
      + state                  = (known after apply)
      + subnet                 = (known after apply)
      + tags                   = (known after apply)
      + terraform_labels       = (known after apply)
      + update_time            = (known after apply)

      + container_image {
          + repository = "eu.gcr.io/tbd-2024l-303946/jupyter"
          + tag        = "3.6.3"
        }
    }

  # module.vertex_ai_workbench.google_project_iam_binding.token_creator_role will be created
  + resource "google_project_iam_binding" "token_creator_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "tbd-2024l-303946"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.vertex_ai_workbench.google_project_service.notebooks will be created
  + resource "google_project_service" "notebooks" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "tbd-2024l-303946"
      + service            = "notebooks.googleapis.com"
    }

  # module.vertex_ai_workbench.google_storage_bucket.notebook-conf-bucket will be created
  + resource "google_storage_bucket" "notebook-conf-bucket" {
      + effective_labels            = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "EUROPE-WEST1"
      + name                        = "tbd-2024l-303946-conf"
      + project                     = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding will be created
  + resource "google_storage_bucket_iam_binding" "binding" {
      + bucket  = "tbd-2024l-303946-conf"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + role    = "roles/storage.objectViewer"
    }

  # module.vertex_ai_workbench.google_storage_bucket_object.post-startup will be created
  + resource "google_storage_bucket_object" "post-startup" {
      + bucket         = "tbd-2024l-303946-conf"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "scripts/notebook_post_startup_script.sh"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "modules/vertex-ai-workbench/resources/notebook_post_startup_script.sh"
      + storage_class  = (known after apply)
    }

  # module.vpc.google_compute_firewall.default-internal-allow-all will be created
  + resource "google_compute_firewall" "default-internal-allow-all" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "default-internal-allow-all"
      + network            = (known after apply)
      + priority           = 65534
      + project            = "tbd-2024l-303946"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.10.10.0/24",
        ]

      + allow {
          + ports    = []
          + protocol = "all"
        }
    }

  # module.vpc.google_compute_firewall.fw-allow-ingress-from-iap will be created
  + resource "google_compute_firewall" "fw-allow-ingress-from-iap" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "fw-allow-ingress-iap"
      + network            = (known after apply)
      + priority           = 1000
      + project            = "tbd-2024l-303946"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "35.235.240.0/20",
        ]

      + allow {
          + ports    = [
              + "22",
              + "8443",
              + "443",
              + "80",
              + "8000",
            ]
          + protocol = "tcp"
        }
    }

  # module.composer.module.composer.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "tbd-2024l-303946"
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.composer.module.composer.google_composer_environment.composer_env will be created
  + resource "google_composer_environment" "composer_env" {
      + effective_labels = (known after apply)
      + id               = (known after apply)
      + name             = "demo-lab"
      + project          = "tbd-2024l-303946"
      + region           = "europe-west1"
      + terraform_labels = (known after apply)

      + config {
          + airflow_uri                = (known after apply)
          + dag_gcs_prefix             = (known after apply)
          + enable_private_builds_only = (known after apply)
          + enable_private_environment = (known after apply)
          + environment_size           = "ENVIRONMENT_SIZE_SMALL"
          + gke_cluster                = (known after apply)
          + node_count                 = (known after apply)
          + resilience_mode            = (known after apply)

          + node_config {
              + composer_internal_ipv4_cidr_block = (known after apply)
              + composer_network_attachment       = (known after apply)
              + disk_size_gb                      = (known after apply)
              + enable_ip_masq_agent              = false
              + ip_allocation_policy              = (known after apply)
              + machine_type                      = (known after apply)
              + max_pods_per_node                 = (known after apply)
              + network                           = "projects/tbd-2024l-303946/global/networks/main-vpc"
              + oauth_scopes                      = (known after apply)
              + service_account                   = (known after apply)
              + subnetwork                        = "projects/tbd-2024l-303946/regions/europe-west1/subnetworks/composer-subnet-01"
              + zone                              = (known after apply)
            }

          + software_config {
              + env_variables           = {
                  + "AIRFLOW_VAR_BUCKET_NAME"         = "tbd-2024l-303946-code"
                  + "AIRFLOW_VAR_DBT_GIT_REPO"        = "https://github.com/mwiewior/tbd-tpc-di.git"
                  + "AIRFLOW_VAR_DBT_GIT_REPO_BRANCH" = "main"
                  + "AIRFLOW_VAR_PHS_CLUSTER"         = "tbd-cluster"
                  + "AIRFLOW_VAR_PROJECT_ID"          = "tbd-2024l-303946"
                  + "AIRFLOW_VAR_REGION_NAME"         = "europe-west1"
                  + "AIRFLOW_VAR_WRK_NAMESPACE"       = "composer-user-workloads"
                }
              + image_version           = "composer-2.4.6-airflow-2.6.3"
              + python_version          = (known after apply)
              + scheduler_count         = (known after apply)
              + web_server_plugins_mode = (known after apply)
            }

          + workloads_config {
              + scheduler {
                  + count      = 1
                  + cpu        = 0.5
                  + memory_gb  = 1.875
                  + storage_gb = 1
                }
              + web_server {
                  + cpu        = 0.5
                  + memory_gb  = 1.875
                  + storage_gb = 1
                }
              + worker {
                  + cpu        = 0.5
                  + max_count  = 3
                  + memory_gb  = 1.875
                  + min_count  = 1
                  + storage_gb = 1
                }
            }
        }
    }

  # module.composer.module.composer.google_project_iam_member.composer_agent_service_account[0] will be created
  + resource "google_project_iam_member" "composer_agent_service_account" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "tbd-2024l-303946"
      + role    = "roles/composer.ServiceAgentV2Ext"
    }

  # module.vpc.module.cloud-router.google_compute_router.router will be created
  + resource "google_compute_router" "router" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "nat-router"
      + network            = (known after apply)
      + project            = "tbd-2024l-303946"
      + region             = "europe-west1"
      + self_link          = (known after apply)
    }

  # module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"] will be created
  + resource "google_compute_router_nat" "nats" {
      + enable_dynamic_port_allocation      = (known after apply)
      + enable_endpoint_independent_mapping = (known after apply)
      + icmp_idle_timeout_sec               = 30
      + id                                  = (known after apply)
      + min_ports_per_vm                    = (known after apply)
      + name                                = "nat-gateway"
      + nat_ip_allocate_option              = "AUTO_ONLY"
      + project                             = "tbd-2024l-303946"
      + region                              = "europe-west1"
      + router                              = "nat-router"
      + source_subnetwork_ip_ranges_to_nat  = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      + tcp_established_idle_timeout_sec    = 1200
      + tcp_time_wait_timeout_sec           = 120
      + tcp_transitory_idle_timeout_sec     = 30
      + udp_idle_timeout_sec                = 30

      + log_config {
          + enable = true
          + filter = "ALL"
        }
    }

  # module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"] will be created
  + resource "google_compute_route" "route" {
      + description            = "route through IGW to access internet"
      + dest_range             = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = "egress-internet"
      + network                = "main-vpc"
      + next_hop_gateway       = "default-internet-gateway"
      + next_hop_instance_zone = (known after apply)
      + next_hop_ip            = (known after apply)
      + next_hop_network       = (known after apply)
      + priority               = 1000
      + project                = "tbd-2024l-303946"
      + self_link              = (known after apply)
    }

  # module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.10.10.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "subnet-01"
      + network                    = "main-vpc"
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "tbd-2024l-303946"
      + purpose                    = (known after apply)
      + region                     = "europe-west1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.vpc.module.vpc.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks                   = false
      + delete_default_routes_on_create           = false
      + enable_ula_internal_ipv6                  = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = 0
      + name                                      = "main-vpc"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + numeric_id                                = (known after apply)
      + project                                   = "tbd-2024l-303946"
      + routing_mode                              = "GLOBAL"
      + self_link                                 = (known after apply)
    }

Plan: 38 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Deprecated Resource

  with module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook,
  on modules/vertex-ai-workbench/main.tf line 49, in resource "google_notebooks_instance" "tbd_notebook":
  49: resource "google_notebooks_instance" "tbd_notebook" {

`google_notebook_instance` is deprecated and will be removed in a future
major release. Use `google_workbench_instance` instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mpater59, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*